import ContactSection from "./ContactSection";
import Header from "./Header";
import ProductSection from "./ProductSection";
import ServiceSection from "./ServiceSection";
import PickingOptionSection from "./PickingOptionSection";
import TestimonailSection from "./TestimonailSection";
import { FiShoppingBag } from "react-icons/fi";
import { Link } from "react-router-dom";

export default function MainPage() {
  return (
    <div>
      <Header />
      <div className="md:px-[20%] px-6 mt-8">
        <p className="text-center">
          استمتع بتجربة فريدة من نوعها عبر استكشاف مجموعتنا الرائعة من الحلوى
          المختارة بعناية. تضم مجموعتنا مجموعة متنوعة من الحلوى الطرية، الحلوى
          الحامضة، الشوكولاته اللذيذة .
        </p>
        <div className="flex">
          <Link
            className="flex items-center mx-auto mt-5 bg-rd text-white px-5 py-2 rounded"
            to="/store"
          >
            ابدأ التسوق
            <FiShoppingBag className="md:text-2xl ml-2" />
          </Link>
        </div>
      </div>
      <ProductSection />
      {/* VISIT US SECTION */}
      <div className="message-style visit-use-section-container text-white -mb-6 text-xl py-14 px-5 text-center ">
        <p>
          في leee3، نفتخر بكوننا محطة الوجهة الأمثلة لعشاق الحلوى. نحن مكان يجمع
          بين التقاليد والابتكار، حيث يمكنكم الاستمتاع بأحدث صيحات عالم الحلوى
          والتمتع بتجربة تسوق فريدة.
        </p>
      </div>
      <PickingOptionSection />
      <ServiceSection />
      <TestimonailSection />
      <ContactSection />
    </div>
  );
}

/*


بالتأكيد، إليك نسخة محسّنة تتضمن معلومات إضافية:

## مرحبًا في leee3!

بينما نغمر أنفسنا في عالم الحلوى، يسرنا أن نرحب بكم في متجرنا المتميز، حيث تنتظركم تجربة فريدة من نوعها. إليكم نظرة عامة على ما يميزنا:

## تصفح مجموعتنا الواسعة

تحظى مجموعتنا بتنوع فريد، ابتداءً من الحلوى الطرية وصولاً إلى الشوكولاته الفاخرة. كل قطعة تعكس اهتمامنا بالتفاصيل ورغبتنا في تقديم تجربة لا تُنسى.

------------------------------------------------------------------------------------

بينما نحن نتأمل في عالم الحلوى، يرحب بكم متجرنا الرائع حيث يتميز بتشكيلة واسعة من الحلوى اللذيذة التي تجلب السعادة إلى حياتكم. إنه المكان المثالي لكل من يبحث عن لمحة حلوة في يومهم.

## تصفح مجموعتنا الواسعة

استمتع بتجربة فريدة من نوعها عبر استكشاف مجموعتنا الرائعة من الحلوى المختارة بعناية. تضم مجموعتنا مجموعة متنوعة من الحلوى الطرية، الحلوى الحامضة، الشوكولاته اللذيذة والكثير من الخيارات اللذيذة الأخرى.

## طرق الاختيار الممتعة

نحن ندرك أن لديكم طرق مختلفة للاستمتاع بحلوياتكم المفضلة، ولهذا نقدم لكم اختيارين مميزين للحصول على طلبكم:

### 1. الاختيار في المكان

زورونا في متجرنا الرائع واستمتعوا بتجربة اختيار الحلوى بأنفسكم. املؤوا أكياسكم بألوان الحلاوة واختاروا ما يناسب ذوقكم من تشكيلتنا الواسعة. سيكون لديكم الفرصة لاكتشاف حلويات جديدة وتجربة طعمها اللذيذ.

### 2. التوصيل

إذا كنتم في حاجة إلى الراحة وتفضلون الاستمتاع بحلوياتكم في منزلكم أو مكان عملكم، يمكننا توصيل الحلوى مباشرة إليكم. اختاروا الحلوى المفضلة لديكم من خلال موقعنا على الإنترنت وسنقوم بتوصيلها بعناية إلى باب منزلكم.

## جودة عالية وخدمة مميزة

نحن نلتزم بتقديم أعلى مستويات الجودة في كل حلوى نقدمها. اعتمدوا على طعم لا يقاوم وتجربة تسوق ممتعة في متجرنا.

تسوقوا اليوم واستمتعوا بعالم الحلوى الذي لا يقاوم!

leee3 - حيث الحلاوة تلتقي بالسعادة.


==========================================================================================
==========================================================================================

*/
